app/views/catches/_catches.html.erb


    <% if @check_in.catch.notes && @check_in.catch.notes.length > 0 %>
---
SELECT  "catches".* FROM "catches"  WHERE "catches"."check_in_id" = ? LIMIT 1  [["check_in_id", 25]]