app/views/vessels/_vessel_partial.html.erb

SELECT  "vessels".* FROM "vessels"  WHERE "vessels"."check_in_id" = ? LIMIT 1  [["check_in_id", 11]]
---
    <strong>Length:</strong>
    <%= @check_in.vessel.length %><br>