app/controllers/catches_controller.rb

SELECT "catches".* FROM "catches"
---
  def index
    @catches = Catch.all

INSERT INTO "catches" ("check_in_id", "created_at", "fishing_style", "notes", "species", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @catch = Catch.new(catch_params)
    check_in_id = @catch.check_in_id.to_s

    respond_to do |format|
      if @catch.save