app/controllers/check_ins_controller.rb

SELECT "check_ins".* FROM "check_ins"
---
  def index
    @check_ins = CheckIn.all

INSERT INTO "check_ins" ("created_at", "lat", "lng", "notes", "report_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-06-14 17:11:00.941845"], ["lat", 40.720301], ["lng", -73.9991514], ["notes", ""], ["report_type", "Poaching // Illegal Fishing"], ["updated_at", "2014-06-14 17:11:00.941845"]]
---
  def create
    @check_in = CheckIn.new(check_in_params)

    respond_to do |format|
      if @check_in.save

UPDATE "check_ins" SET "report_time" = ?, "report_type" = ?, "updated_at" = ? WHERE "check_ins"."id" = 6  [["report_time", "2014-06-14 06:31:00.000000"], ["report_type", "Poaching // Illegal Fishing"], ["updated_at", "2014-06-14 17:32:03.246314"]]
---
  def update
    respond_to do |format|
      if @check_in.update(check_in_params)

DELETE FROM "check_ins" WHERE "check_ins"."id" = ?  [["id", 4]]
---
  def destroy
    @check_in.destroy

SELECT  "check_ins".* FROM "check_ins"  WHERE "check_ins"."id" = ? LIMIT 1  [["id", 6]]
---
    def set_check_in
      @check_in = CheckIn.find(params[:id])