app/controllers/check_in_images_controller.rb

SELECT "check_in_images".* FROM "check_in_images"
---
  def index
    @check_in_images = CheckInImage.all

INSERT INTO "check_in_images" ("check_in_id", "created_at", "description", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @check_in_image = CheckInImage.new(check_in_image_params)
    check_in_id = @check_in_image.check_in_id.to_s

    respond_to do |format|
      if @check_in_image.save

SELECT  "check_in_images".* FROM "check_in_images"  WHERE "check_in_images"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_check_in_image
      @check_in_image = CheckInImage.find(params[:id])