app/controllers/reports_controller.rb

  def index
  	@search = CheckIn.search do
---
SELECT "check_ins".* FROM "check_ins"