app/controllers/vessels_controller.rb

SELECT "vessels".* FROM "vessels"
---
  def index
    @vessels = Vessel.all

INSERT INTO "vessels" ("check_in_id", "color", "created_at", "estimated_crew", "length", "notes", "updated_at", "vessel_name", "vessel_number", "vessel_type") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @vessel = Vessel.new(vessel_params)

    respond_to do |format|
      if @vessel.save