app/views/check_in_images/_images.html.erb

SELECT  "check_in_images".* FROM "check_in_images"  WHERE "check_in_images"."check_in_id" = ? LIMIT 1  [["check_in_id", 15]]
---
  	<%= image_tag image.image.url(:small) %>
  	<% if @check_in.check_in_image.description && @check_in.check_in_image.description.length > 0 %>